{
  "releases": [
    {
      "version": "0.7.0",
      "date": "2024-02-11",
      "highlights": "Funktion zum Löschen des Kontos. Neue Inventarkomponente.",
      "changes": [
        {
          "type": "feature",
          "text": "Funktion zum Löschen des Kontos (auf der Seite Einstellungen)"
        },
        {
          "type": "feature",
          "text": "Neue Inventarkomponente. In drei Bereiche aufgeteilt; das vollständige Inventar wird in einem separaten Panel angezeigt."
        },
        {
          "type": "improvement",
          "text": "Die Option Waren versenden zeigt jetzt an, wie viele Credits verdient werden."
        },
        {
          "type": "improvement",
          "text": "Inventarkapazität und -erweiterung werden nun in der Benutzeroberfläche besser erklärt"
        },
        {
          "type": "improvement",
          "text": "Es wurden \"Großlos\"-Rezepte hinzugefügt, mit denen einige grundlegende Teile in höheren Mengen auf fortgeschritteneren Maschinen gefertigt werden können"
        }
      ]
    },
    {
      "version": "0.6.7",
      "date": "2024-02-11",
      "highlights": "Zusätzliche Korrekturen",
      "changes": [
        {
          "type": "fix",
          "text": "Mehrere potenzielle Sicherheitslücken wurden behoben"
        }
      ]
    },
    {
      "version": "0.6.6",
      "date": "2024-02-11",
      "highlights": "Kleine UX-/Darstellungskorrekturen",
      "changes": [
        {
          "type": "fix",
          "text": "Die Experimentierkammer ist jetzt auch auf Bildschirmen mit geringer Höhe nutzbar"
        },
        {
          "type": "fix",
          "text": "Ein kleines Darstellungsproblem beim Öffnen und Schließen des Generator-Bauen-Popups wurde behoben"
        }
      ]
    },
    {
      "version": "0.6.5",
      "date": "2024-02-10",
      "highlights": "Versandoption für Waren. Inventarerweiterung. Zusätzliche Tipps. Balance-Änderungen im Spiel.",
      "changes": [
        {
          "type": "feature",
          "text": "Versandoption für Waren: Es ist jetzt möglich, alle Gegenstände direkt auf der Fabrikseite zu verkaufen"
        },
        {
          "type": "feature",
          "text": "Inventarerweiterung: Es ist jetzt möglich, den verfügbaren Lagerplatz zu erhöhen"
        },
        {
          "type": "improvement",
          "text": "Balance-Änderungen: Kosten und Verbrauch mehrerer unterschiedlicher Rezepte und Generatoren wurden angepasst"
        },
        {
          "type": "improvement",
          "text": "Mehrere zusätzliche Tipps für verschiedene Spielereignisse hinzugefügt"
        },
        {
          "type": "improvement",
          "text": "Die Enzyklopädie zeigt jetzt Kraftstoffverbrauch und Kraftstofftyp von Generatoren, die Kraftstoff benötigen"
        }
      ]
    },
    {
      "version": "0.6.1",
      "date": "2024-02-09",
      "highlights": "Balance-Änderungen und Fehlerbehebungen",
      "changes": [
        {
          "type": "improvement",
          "text": "Balance-Änderungen: Kosten, Gewicht und Verbrauch mehrerer verschiedener Rezepte wurden angepasst"
        },
        {
          "type": "fix",
          "text": "Öl kann jetzt auf der Karte gewonnen werden (Sumpf- und Wüstenbiome erscheinen)"
        }
      ]
    },
    {
      "version": "0.6.0",
      "date": "2024-02-08",
      "highlights": "Neuer Enzyklopädie-Tab. Neue Inventarkomponente. Mehrere Visualisierungsprobleme in der Fabrik behoben.",
      "changes": [
        {
          "type": "feature",
          "text": "Neuer Enzyklopädie-Tab. Er kann genutzt werden, um alle erforschten Rezepte zu durchsuchen und zu sehen, wie sie hergestellt werden."
        },
        {
          "type": "improvement",
          "text": "Neue Inventarkomponente. Endprodukte und Teile werden getrennt angezeigt. Der verfügbare Platz für Endprodukte wird visuell dargestellt."
        },
        {
          "type": "fix",
          "text": "Mehrere Visualisierungsprobleme in der Fabrik wurden behoben."
        }
      ]
    },
    {
      "version": "0.5.5",
      "date": "2024-02-07",
      "highlights": "Maschinenforschung und zirkuläre Abhängigkeiten behoben. Visualisierung von Rohstoff- und Teileproduktion sowie -verbrauch verbessert.",
      "changes": [
        {
          "type": "improvement",
          "text": "Produktion und Verbrauch von Teilen werden jetzt im Fabrik-Tab klar angezeigt"
        },
        {
          "type": "improvement",
          "text": "Rohstoffzufuhr und -verbrauch werden jetzt im Fabrik- und Erkundungs-Tab angezeigt"
        },
        {
          "type": "improvement",
          "text": "Es ist jetzt möglich, die Forschung benötigter Maschinen gezielt anzusteuern"
        },
        {
          "type": "improvement",
          "text": "Es ist jetzt möglich, mehr als eine Maschine oder einen Generator gleichzeitig zu bauen"
        },
        {
          "type": "fix",
          "text": "Maschinen können jetzt wieder erforscht werden"
        },
        {
          "type": "fix",
          "text": "Mehrere zirkuläre Abhängigkeiten zwischen Rezepten und Maschinen wurden behoben"
        }
      ]
    },
    {
      "version": "0.5.0",
      "date": "2024-02-06",
      "highlights": "Signifikante Neuausrichtung der Spielmechaniken. Neues Design der Solaranlage.",
      "changes": [
        {
          "type": "improvement",
          "text": "Mehrere Spielmechaniken wurden deutlich neu ausbalanciert, darunter Fabrik- und Kartenerweiterung, Knotenfreischaltungen und Forschung"
        },
        {
          "type": "improvement",
          "text": "Dem Ausgleichs-Bot, der für die Spielbalance verwendet wird, wurden sehr bedeutende Verbesserungen hinzugefügt"
        },
        {
          "type": "improvement",
          "text": "Neues Design der Solaranlage"
        }
      ]
    },
    {
      "version": "0.4.6",
      "date": "2024-02-04",
      "highlights": "Beschreibungen für Gegenstände hinzugefügt. E-Mail-Format angepasst. Neuer Tick-Fortschrittsindikator mit zwei Zahnrädern.",
      "changes": [
        {
          "type": "improvement",
          "text": "Beschreibungen für Gegenstände hinzugefügt"
        },
        {
          "type": "improvement",
          "text": "E-Mail-Format angepasst"
        },
        {
          "type": "improvement",
          "text": "Neuer Tick-Fortschrittsindikator mit zwei Zahnrädern"
        }
      ]
    },
    {
      "version": "0.4.5",
      "date": "2024-02-03",
      "highlights": "Übersetzungen für Französisch, Deutsch und Italienisch hinzugefügt. Neuer Markt-Tab und Anpassungen im Forschungs-Tab.",
      "changes": [
        {
          "type": "feature",
          "text": "Neuer Markt-Tab. Layout überarbeitet, um relevantere Informationen zu zeigen"
        },
        {
          "type": "feature",
          "text": "Übersetzungen für Französisch, Deutsch und Italienisch hinzugefügt."
        },
        {
          "type": "improvement",
          "text": "Automatisierte Unit-Tests und End-to-End-Tests hinzugefügt"
        },
        {
          "type": "improvement",
          "text": "Forschungsbereich angepasst, damit klarer ist, wie viele Credits ausgegeben werden und wie viele übrig bleiben."
        }
      ]
    },
    {
      "version": "0.4.0",
      "date": "2024-02-01",
      "highlights": "Zum Spiel einladen. Riesige Leistungsverbesserungen beim Fabrikbau.",
      "changes": [
        {
          "type": "feature",
          "text": "Funktion 'Zum Spiel einladen' hinzugefügt."
        },
        {
          "type": "improvement",
          "text": "Leistung beim Ziehen von Maschinen und Generatoren in der Fabrik stark verbessert"
        },
        {
          "type": "improvement",
          "text": "Präzisionsmonteur und Elektronikfabrik hinzugefügt"
        },
        {
          "type": "fix",
          "text": "Problem gelöst, bei dem Vorkommen auf der Karte nicht sichtbar waren, auch wenn es Rezepte gab, die diese Materialien benötigten."
        }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2024-02-01",
      "highlights": "Signifikante Mechanik-Rebalance.",
      "changes": [
        {
          "type": "feature",
          "text": "Produktionsbereitstellungsmechanismus hinzugefügt."
        },
        {
          "type": "improvement",
          "text": "Signifikante Rebalance der Spielmechaniken."
        },
        {
          "type": "improvement",
          "text": "Gießerei und Chemiefabrik hinzugefügt"
        }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2024-01-31",
      "highlights": "Visuelle Verbesserungen der Erkundungskarte. Neugestaltung des Fabriklayouts. Benutzer-Audit-Infos.",
      "changes": [
        {
          "type": "feature",
          "text": "Die Erkundungskarte ist wieder isometrisch und folgt einem anderen, ausgewogeneren Generierungsmuster."
        },
        {
          "type": "feature",
          "text": "Hauptlayout des Fabrik-Tabs geändert"
        },
        {
          "type": "feature",
          "text": "Benutzer-Audit-Sitzungsinformationen hinzugefügt"
        },
        {
          "type": "improvement",
          "text": "Das Freischalten erforschter Rezepte gibt jetzt zusätzliche Forschungspunkte und steigert auch die gesamte Forschungsproduktion"
        },
        {
          "type": "improvement",
          "text": "Stahlschmiede, Schwerlastmontageanlage hinzugefügt"
        },
        {
          "type": "fix",
          "text": "Das Auswählen und Ziehen von Gebäuden wurde verbessert. Wenn zwei Gebäude nebeneinander liegen, funktioniert es jetzt viel zuverlässiger und mit viel besserer Leistung."
        }
      ]
    },
    {
      "version": "0.1.6",
      "date": "2024-01-29",
      "highlights": "Visualisierung des Ressourcenladens. Neues Fabriklayout. Neue Stromgeneratoren",
      "changes": [
        {
          "type": "feature",
          "text": "Ladebalken zur Startseite hinzugefügt"
        },
        {
          "type": "feature",
          "text": "Hauptlayout des Fabrik-Tabs geändert"
        },
        {
          "type": "improvement",
          "text": "Dieselkraftwerk, Solaranlage und Kernreaktor hinzugefügt"
        },
        {
          "type": "fix",
          "text": "Jetzt können Rezepte, die Rohstoffe für den Prototyp benötigen, freigeschaltet werden (der Prototyp erhält automatisch die Rohstoffe, wenn dafür Extraktionsvorkommen vorhanden sind)."
        }
      ]
    },
    {
      "version": "0.1.5",
      "date": "2024-01-25",
      "highlights": "Tutorial und Tipps. Neue Generatoren.",
      "changes": [
        {
          "type": "feature",
          "text": "Schnellspiel-Tutorial hinzugefügt, das erscheint, wenn der Benutzer ein neues Spiel erstellt"
        },
        {
          "type": "feature",
          "text": "Tipp-Mechanismus hinzugefügt, der dem Benutzer dynamisch während des Spiels hilft. Dies wird in nachfolgenden Versionen erweitert"
        },
        {
          "type": "feature",
          "text": "Feedback-Mechanismus hinzugefügt, damit Benutzer Feedback an die Entwickler senden können"
        },
        {
          "type": "improvement",
          "text": "Authentifizierung/Erstanmeldung wurde verbessert. Jetzt ist keine Admin-Genehmigung mehr erforderlich, und eine Willkommens-E-Mail wird automatisch an den Benutzer gesendet."
        },
        {
          "type": "improvement",
          "text": "Externe Marktdynamik hinzugefügt. Verwaltung der Marktpreishistorie verbessert."
        },
        {
          "type": "improvement",
          "text": "Wärmekraftgenerator, Windmühle und Kohlekraftwerk hinzugefügt"
        }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2024-01-20",
      "highlights": "Neues UI-Look&Feel. Forschungsverbesserungen.",
      "changes": [
        {
          "type": "feature",
          "text": "Neues UI-Look&Feel mit anderen Farben. Spielelogo hinzugefügt."
        },
        {
          "type": "feature",
          "text": "Neue Forschungsmechanik: Gezieltes Experiment."
        },
        {
          "type": "feature",
          "text": "Forschungsmechanik: Die Art und Weise, wie Prototypen nach dem Freischalten des Rezepts gebaut werden, wurde angepasst."
        },
        {
          "type": "improvement",
          "text": "Badge hinzugefügt, um ausstehende Rezepte zum Freischalten im Forschungs-Tab anzuzeigen."
        },
        {
          "type": "improvement",
          "text": "Boden um die Fabrik neu gestaltet."
        },
        {
          "type": "improvement",
          "text": "Treibstoffanforderung für Generatoren hinzugefügt und Generatoren allgemein angepasst."
        },
        {
          "type": "fix",
          "text": "Materialien werden erst verbraucht, wenn der Prototyp gebaut ist."
        }
      ]
    }
  ]
}
