{
  "releases": [
    {
      "version": "0.2.0",
      "date": "2024-01-30",
      "highlights": "Asset loading visualization. New Factory layout. New power generators",
      "changes": [
        {
          "type": "feature",
          "text": "Exploration map is isometric again, and follows a different, more balanced generation pattern."
        },
        {
          "type": "feature",
          "text": "Changed main layout of the Factory tab"
        },
        {
          "type": "feature",
          "text": "Added user audit session information"
        },
        {
          "type": "improvement",
          "text": "Unlocking researched recipes will now give additional research points, and also boost overall research production"
        },
        {
          "type": "improvement",
          "text": "Added steel forge and heavy assembly plant"
        },
        {
          "type": "fix",
          "text": "Improved picking and dragging of buildings, now if two buildings are beside each other it works much more reliably."
        }
      ]
    },
    {
      "version": "0.1.6",
      "date": "2024-01-29",
      "highlights": "Asset loading visualization. New Factory layout. New power generators",
      "changes": [
        {
          "type": "feature",
          "text": "Added loading progress bar to the landing page"
        },
        {
          "type": "feature",
          "text": "Changed main layout of the Factory tab"
        },
        {
          "type": "improvement",
          "text": "Added the diesel power plant, the solar array, and the nuclear reactor"
        },
        {
          "type": "fix",
          "text": "Now recipes that require raw materials for the prototype can be unlocked (prototype will automatically receive the raw materials, if extraction nodes exist for it)."
        }
      ]
    },
    {
      "version": "0.1.5",
      "date": "2024-01-25",
      "highlights": "Tutorial and tips. New generators.",
      "changes": [
        {
          "type": "feature",
          "text": "Added quick game tutorial, that appears when the user creates a new game"
        },
        {
          "type": "feature",
          "text": "Added a tips mechanism that helps the user dynamically during the game. This will be expanded in subsequent releases"
        },
        {
          "type": "feature",
          "text": "Added a feedback mechanism to allow users to send feedback to the developers"
        },
        {
          "type": "improvement",
          "text": "Authentication/first login has been improved. Now it doesn't require admin approval, and a wellcome email is automatically sent to the user."
        },
        {
          "type": "improvement",
          "text": "Added external market dynamics. Improved market price history management."
        },
        {
          "type": "improvement",
          "text": "Added thermal generator, windmill and coal power plant"
        }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2024-01-20",
      "highlights": "New UI look&feel. Research improvements.",
      "changes": [
        {
          "type": "feature",
          "text": "New UI look&feel, with different colors. Added Game logo."
        },
        {
          "type": "feature",
          "text": "New research mechanic: Targetted experiment."
        },
        {
          "type": "feature",
          "text": "Research mechanic: Adjusted the way prototypes are built after the recipe has been unlocked."
        },
        {
          "type": "improvement",
          "text": "Added badge to display pending recipes to unlock in Research tab."
        },
        {
          "type": "improvement",
          "text": "Redesigned ground around factory."
        },
        {
          "type": "improvement",
          "text": "Added fuel requirement to generators, and adjusted generators in general."
        },
        {
          "type": "fix",
          "text": "Materials will only be consumed once the prototype is built."
        }
      ]
    }
  ]
}