{
  "releases": [
    {
      "version": "0.7.0",
      "date": "2024-02-11",
      "highlights": "Account deletion feature. New Inventory component.",
      "changes": [
        {
          "type": "feature",
          "text": "Account deletion feature (in Settings page)"
        },
        {
          "type": "feature",
          "text": "New Inventory component. Divided in three parts, full inventory shown in separate panel."
        },
        {
          "type": "improvement",
          "text": "Ship goods option will now show how many credits will be earned."
        },
        {
          "type": "improvement",
          "text": "Inventory capacity and expansion are now better explained in the UI"
        },
        {
          "type": "improvement",
          "text": "Added 'bulk' recipes, that allow to manufacture some basic parts in higher volumes in more advanced machines"
        }
      ]
    },
    {
      "version": "0.6.7",
      "date": "2024-02-11",
      "highlights": "Additional fixes",
      "changes": [
        {
          "type": "fix",
          "text": "Fixed several potential vulnerability issues"
        }
      ]
    },
    {
      "version": "0.6.6",
      "date": "2024-02-11",
      "highlights": "Small UX/visualization fixes",
      "changes": [
        {
          "type": "fix",
          "text": "Now the Experiment Chamber will be usable on shorter-height screens"
        },
        {
          "type": "fix",
          "text": "Fixed small visualization issue when opening and closing the Build Generator popup"
        }
      ]
    },
    {
      "version": "0.6.5",
      "date": "2024-02-10",
      "highlights": "Ship Goods option. Inventory extension. Additional tips. Game balance changes.",
      "changes": [
        {
          "type": "feature",
          "text": "Ship Goods option: now it is possible to sell all items from the Factory page"
        },
        {
          "type": "feature",
          "text": "Inventory extension: now it is possible to increase the available space in the inventory"
        },
        {
          "type": "improvement",
          "text": "Balance changes, adjusted cost and consumption of several different recipes and generators"
        },
        {
          "type": "improvement",
          "text": "Added several more tips for multiple game events"
        },
        {
          "type": "improvement",
          "text": "Now the Encyclopedia will show the fuel consumption and type of generators that require it"
        }
      ]
    },
    {
      "version": "0.6.1",
      "date": "2024-02-09",
      "highlights": "Balance changes and fixes",
      "changes": [
        {
          "type": "improvement",
          "text": "Balance changes, adjusted cost, weight and consumption of several different recipes"
        },
        {
          "type": "fix",
          "text": "Now oil will be possible to be obtained in the map (swamps and desert biomes will appear)"
        }
      ]
    },
    {
      "version": "0.6.0",
      "date": "2024-02-08",
      "highlights": "New Encyclopedia tab. New Inventory component. Fixed several factory visualization issues.",
      "changes": [
        {
          "type": "feature",
          "text": "New Encyclopedia tab. Can be used to browse all researched recipes and see how they are made."
        },
        {
          "type": "improvement",
          "text": "New Inventory component. Final goods and parts are shown separately. Available space is indicated visually for final goods."
        },
        {
          "type": "fix",
          "text": "Fixed several factory visualization issues."
        }
      ]
    },
    {
      "version": "0.5.5",
      "date": "2024-02-07",
      "highlights": "Fixed machine research, and circular dependencies. Improved visualization of raw material and parts input and consumption.",
      "changes": [
        {
          "type": "improvement",
          "text": "Parts production and consumption will be clearly shown in the factory tab"
        },
        {
          "type": "improvement",
          "text": "Raw material input and consumption is now displayed in the factory and exploration tabs"
        },
        {
          "type": "improvement",
          "text": "It is now possible to target the research of required machines"
        },
        {
          "type": "improvement",
          "text": "Now it is possible to build more than one machine or generator at the same time"
        },
        {
          "type": "fix",
          "text": "Machines are now researchable again"
        },
        {
          "type": "fix",
          "text": "Fixed several circular dependencies between recipes and machines"
        }
      ]
    },
    {
      "version": "0.5.0",
      "date": "2024-02-06",
      "highlights": "Significant game mechanics rebalance. New Solar Array design.",
      "changes": [
        {
          "type": "improvement",
          "text": "Significantly rebalanced several mechanics of the game, including factory and map expansion, node unlocks, and research"
        },
        {
          "type": "improvement",
          "text": "Added very significant improvements to the balancing bot used to balance the game"
        },
        {
          "type": "improvement",
          "text": "New Solar Array design"
        }
      ]
    },
    {
      "version": "0.4.6",
      "date": "2024-02-04",
      "highlights": "Added descriptions for items. Adjusted email format. New tick progress indicator with two gears.",
      "changes": [
        {
          "type": "improvement",
          "text": "Added descriptions for items"
        },
        {
          "type": "improvement",
          "text": "Adjusted email format"
        },
        {
          "type": "improvement",
          "text": "New tick progress indicator with two gears"
        }
      ]
    },
    {
      "version": "0.4.5",
      "date": "2024-02-03",
      "highlights": "Translations for French, German and Italian added. New Market tab and Research tab adjustments.",
      "changes": [
        {
          "type": "feature",
          "text": "New Market tab. Remade the layout, show more and more relevant information"
        },
        {
          "type": "feature",
          "text": "Translations for French, German and Italian added."
        },
        {
          "type": "improvement",
          "text": "Added automated unit tests, and end-to-end tests"
        },
        {
          "type": "improvement",
          "text": "Adjusted Research panel to more clearly show how many credits are being spent and how many remain"
        }
      ]
    },
    {
      "version": "0.4.0",
      "date": "2024-02-01",
      "highlights": "Invite to Game. Huge performance improvements in Factory construction.",
      "changes": [
        {
          "type": "feature",
          "text": "Added Invite to Game feature."
        },
        {
          "type": "improvement",
          "text": "Greatly improved performance when dragging machines and generators in the factory"
        },
        {
          "type": "improvement",
          "text": "Added precision assembler and electronics fab"
        },
        {
          "type": "fix",
          "text": "Solved problem with nodes not being visible in the map even if there are recipes requiring those materials."
        }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2024-02-01",
      "highlights": "Significant mechanics rebalance.",
      "changes": [
        {
          "type": "feature",
          "text": "Added production deployment mechanism."
        },
        {
          "type": "improvement",
          "text": "Significant rebalance of the game mechanics."
        },
        {
          "type": "improvement",
          "text": "Added foundry and chemical plant"
        }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2024-01-31",
      "highlights": "Exploration map visual improvements. Factory layout redesign. User audit info.",
      "changes": [
        {
          "type": "feature",
          "text": "Exploration map is isometric again, and follows a different, more balanced generation pattern."
        },
        {
          "type": "feature",
          "text": "Changed main layout of the Factory tab"
        },
        {
          "type": "feature",
          "text": "Added user audit session information"
        },
        {
          "type": "improvement",
          "text": "Unlocking researched recipes will now give additional research points, and also boost overall research production"
        },
        {
          "type": "improvement",
          "text": "Added steel forge, heavy assembly plant"
        },
        {
          "type": "fix",
          "text": "Improved picking and dragging of buildings, now if two buildings are beside each other it works much more reliably, and with much greater performance."
        }
      ]
    },
    {
      "version": "0.1.6",
      "date": "2024-01-29",
      "highlights": "Asset loading visualization. New Factory layout. New power generators",
      "changes": [
        {
          "type": "feature",
          "text": "Added loading progress bar to the landing page"
        },
        {
          "type": "feature",
          "text": "Changed main layout of the Factory tab"
        },
        {
          "type": "improvement",
          "text": "Added the diesel power plant, the solar array, and the nuclear reactor"
        },
        {
          "type": "fix",
          "text": "Now recipes that require raw materials for the prototype can be unlocked (prototype will automatically receive the raw materials, if extraction nodes exist for it)."
        }
      ]
    },
    {
      "version": "0.1.5",
      "date": "2024-01-25",
      "highlights": "Tutorial and tips. New generators.",
      "changes": [
        {
          "type": "feature",
          "text": "Added quick game tutorial, that appears when the user creates a new game"
        },
        {
          "type": "feature",
          "text": "Added a tips mechanism that helps the user dynamically during the game. This will be expanded in subsequent releases"
        },
        {
          "type": "feature",
          "text": "Added a feedback mechanism to allow users to send feedback to the developers"
        },
        {
          "type": "improvement",
          "text": "Authentication/first login has been improved. Now it doesn't require admin approval, and a wellcome email is automatically sent to the user."
        },
        {
          "type": "improvement",
          "text": "Added external market dynamics. Improved market price history management."
        },
        {
          "type": "improvement",
          "text": "Added thermal generator, windmill and coal power plant"
        }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2024-01-20",
      "highlights": "New UI look&feel. Research improvements.",
      "changes": [
        {
          "type": "feature",
          "text": "New UI look&feel, with different colors. Added Game logo."
        },
        {
          "type": "feature",
          "text": "New research mechanic: Targetted experiment."
        },
        {
          "type": "feature",
          "text": "Research mechanic: Adjusted the way prototypes are built after the recipe has been unlocked."
        },
        {
          "type": "improvement",
          "text": "Added badge to display pending recipes to unlock in Research tab."
        },
        {
          "type": "improvement",
          "text": "Redesigned ground around factory."
        },
        {
          "type": "improvement",
          "text": "Added fuel requirement to generators, and adjusted generators in general."
        },
        {
          "type": "fix",
          "text": "Materials will only be consumed once the prototype is built."
        }
      ]
    }
  ]
}