{
  "releases": [
    {
      "version": "0.7.0",
      "date": "2024-02-11",
      "highlights": "Fonction de suppression de compte. Nouveau composant d'inventaire.",
      "changes": [
        {
          "type": "feature",
          "text": "Fonction de suppression de compte (dans la page Paramètres)"
        },
        {
          "type": "feature",
          "text": "Nouveau composant d'inventaire. Divisé en trois parties, l'inventaire complet est affiché dans un panneau séparé."
        },
        {
          "type": "improvement",
          "text": "L'option Expédier les biens affichera désormais le nombre de crédits gagnés."
        },
        {
          "type": "improvement",
          "text": "La capacité de l'inventaire et son extension sont désormais mieux expliquées dans l'interface"
        },
        {
          "type": "improvement",
          "text": "Ajout de recettes \"en lot\" permettant de fabriquer certaines pièces de base en plus grand volume sur des machines plus avancées"
        }
      ]
    },
    {
      "version": "0.6.7",
      "date": "2024-02-11",
      "highlights": "Corrections supplémentaires",
      "changes": [
        {
          "type": "fix",
          "text": "Correction de plusieurs problèmes potentiels de vulnérabilité"
        }
      ]
    },
    {
      "version": "0.6.6",
      "date": "2024-02-11",
      "highlights": "Petites corrections UX/visualisation",
      "changes": [
        {
          "type": "fix",
          "text": "La chambre d'expérimentation est désormais utilisable même sur les écrans de faible hauteur"
        },
        {
          "type": "fix",
          "text": "Correction d'un petit problème d'affichage lors de l'ouverture et de la fermeture de la fenêtre de construction de générateur"
        }
      ]
    },
    {
      "version": "0.6.5",
      "date": "2024-02-10",
      "highlights": "Option Expédier les biens. Extension de l'inventaire. Conseils supplémentaires. Ajustements d'équilibrage du jeu.",
      "changes": [
        {
          "type": "feature",
          "text": "Option Expédier les biens : il est désormais possible de vendre tous les objets depuis la page Usine"
        },
        {
          "type": "feature",
          "text": "Extension de l'inventaire : il est désormais possible d'augmenter l'espace disponible dans l'inventaire"
        },
        {
          "type": "improvement",
          "text": "Ajustements d'équilibrage : le coût et la consommation de plusieurs recettes et générateurs ont été ajustés"
        },
        {
          "type": "improvement",
          "text": "Ajout de plusieurs conseils supplémentaires pour différents événements du jeu"
        },
        {
          "type": "improvement",
          "text": "L'Encyclopédie affiche désormais le type de carburant et la consommation des générateurs qui en nécessitent"
        }
      ]
    },
    {
      "version": "0.6.1",
      "date": "2024-02-09",
      "highlights": "Ajustements d'équilibrage et corrections",
      "changes": [
        {
          "type": "improvement",
          "text": "Ajustements d'équilibrage : le coût, le poids et la consommation de plusieurs recettes ont été modifiés"
        },
        {
          "type": "fix",
          "text": "Le pétrole peut désormais être obtenu sur la carte (des biomes marécageux et désertiques apparaîtront)"
        }
      ]
    },
    {
      "version": "0.6.0",
      "date": "2024-02-08",
      "highlights": "Nouvel onglet Encyclopédie. Nouveau composant Inventaire. Correction de plusieurs problèmes de visualisation de l'usine.",
      "changes": [
        {
          "type": "feature",
          "text": "Nouvel onglet Encyclopédie. Il permet de parcourir toutes les recettes recherchées et de voir comment elles sont fabriquées."
        },
        {
          "type": "improvement",
          "text": "Nouveau composant Inventaire. Les biens finaux et les pièces sont affichés séparément. L'espace disponible pour les biens finaux est indiqué visuellement."
        },
        {
          "type": "fix",
          "text": "Correction de plusieurs problèmes de visualisation de l'usine."
        }
      ]
    },
    {
      "version": "0.5.5",
      "date": "2024-02-07",
      "highlights": "Recherche des machines et dépendances circulaires corrigées. Visualisation de la production et de la consommation de matières premières et de pièces améliorée.",
      "changes": [
        {
          "type": "improvement",
          "text": "La production et la consommation des pièces sont désormais clairement affichées dans l'onglet Usine"
        },
        {
          "type": "improvement",
          "text": "L'approvisionnement et la consommation de matières premières sont désormais affichés dans les onglets Usine et Exploration"
        },
        {
          "type": "improvement",
          "text": "Il est désormais possible de cibler la recherche des machines requises"
        },
        {
          "type": "improvement",
          "text": "Il est désormais possible de construire plus d'une machine ou d'un générateur à la fois"
        },
        {
          "type": "fix",
          "text": "Les machines peuvent de nouveau être recherchées"
        },
        {
          "type": "fix",
          "text": "Correction de plusieurs dépendances circulaires entre recettes et machines"
        }
      ]
    },
    {
      "version": "0.5.0",
      "date": "2024-02-06",
      "highlights": "Rééquilibrage significatif des mécaniques de jeu. Nouveau design du parc solaire.",
      "changes": [
        {
          "type": "improvement",
          "text": "Rééquilibrage significatif de plusieurs mécaniques du jeu, y compris l'expansion de l'usine et de la carte, le déverrouillage des gisements et la recherche"
        },
        {
          "type": "improvement",
          "text": "Ajout d'améliorations très significatives au bot d'équilibrage utilisé pour équilibrer le jeu"
        },
        {
          "type": "improvement",
          "text": "Nouveau design du parc solaire"
        }
      ]
    },
    {
      "version": "0.4.6",
      "date": "2024-02-04",
      "highlights": "Ajout de descriptions pour les objets. Format d’e-mail ajusté. Nouvel indicateur de progression du tick avec deux engrenages.",
      "changes": [
        {
          "type": "improvement",
          "text": "Ajout de descriptions pour les objets"
        },
        {
          "type": "improvement",
          "text": "Format d’e-mail ajusté"
        },
        {
          "type": "improvement",
          "text": "Nouvel indicateur de progression du tick avec deux engrenages"
        }
      ]
    },
    {
      "version": "0.4.5",
      "date": "2024-02-03",
      "highlights": "Ajout des traductions en français, allemand et italien. Nouvel onglet Marché et ajustements de la Recherche.",
      "changes": [
        {
          "type": "feature",
          "text": "Nouvel onglet Marché. Refonte de la mise en page pour afficher des informations plus pertinentes"
        },
        {
          "type": "feature",
          "text": "Ajout des traductions en français, allemand et italien."
        },
        {
          "type": "improvement",
          "text": "Ajout de tests unitaires automatisés et de tests end-to-end"
        },
        {
          "type": "improvement",
          "text": "Ajustement du panneau Recherche pour montrer plus clairement combien de crédits sont dépensés et ce qu'il en reste."
        }
      ]
    },
    {
      "version": "0.4.0",
      "date": "2024-02-01",
      "highlights": "Inviter au Jeu. Améliorations énormes des performances dans la construction d'Usine.",
      "changes": [
        {
          "type": "feature",
          "text": "Ajout de la fonctionnalité Inviter au Jeu."
        },
        {
          "type": "improvement",
          "text": "Performances grandement améliorées lors du glissement de machines et générateurs dans l'usine"
        },
        {
          "type": "improvement",
          "text": "Ajout de l'assembleur de précision et de la fab électronique"
        },
        {
          "type": "fix",
          "text": "Résolution du problème des gisements non visibles sur la carte même s'il y a des recettes nécessitant ces matériaux."
        }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2024-02-01",
      "highlights": "Rééquilibrage significatif des mécaniques.",
      "changes": [
        {
          "type": "feature",
          "text": "Ajout du mécanisme de déploiement de production."
        },
        {
          "type": "improvement",
          "text": "Rééquilibrage significatif des mécaniques de jeu."
        },
        {
          "type": "improvement",
          "text": "Ajout de la fonderie et de l'usine chimique"
        }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2024-01-31",
      "highlights": "Améliorations visuelles de la carte d'exploration. Refonte de la disposition de l'Usine. Infos d'audit utilisateur.",
      "changes": [
        {
          "type": "feature",
          "text": "La carte d'exploration est à nouveau isométrique et suit un modèle de génération différent et plus équilibré."
        },
        {
          "type": "feature",
          "text": "Changement de la disposition principale de l'onglet Usine"
        },
        {
          "type": "feature",
          "text": "Ajout des informations de session d'audit utilisateur"
        },
        {
          "type": "improvement",
          "text": "Débloquer des recettes recherchées donnera maintenant des points de recherche supplémentaires, et augmentera également la production globale de recherche"
        },
        {
          "type": "improvement",
          "text": "Ajout de la forge d'acier, usine d'assemblage lourd"
        },
        {
          "type": "fix",
          "text": "Amélioration de la sélection et du glissement des bâtiments, maintenant si deux bâtiments sont côte à côte, cela fonctionne beaucoup plus fiablement, et avec de bien meilleures performances."
        }
      ]
    },
    {
      "version": "0.1.6",
      "date": "2024-01-29",
      "highlights": "Visualisation du chargement des ressources. Nouvelle disposition d'Usine. Nouveaux générateurs d'énergie",
      "changes": [
        {
          "type": "feature",
          "text": "Ajout d'une barre de progression de chargement sur la page d'accueil"
        },
        {
          "type": "feature",
          "text": "Changement de la disposition principale de l'onglet Usine"
        },
        {
          "type": "improvement",
          "text": "Ajout de la centrale diesel, du parc solaire et du réacteur nucléaire"
        },
        {
          "type": "fix",
          "text": "Désormais, les recettes nécessitant des matières premières pour le prototype peuvent être débloquées (le prototype recevra automatiquement les matières premières, si des gisements d'extraction existent pour celles-ci)."
        }
      ]
    },
    {
      "version": "0.1.5",
      "date": "2024-01-25",
      "highlights": "Tutoriel et astuces. Nouveaux générateurs.",
      "changes": [
        {
          "type": "feature",
          "text": "Ajout d'un tutoriel de jeu rapide, qui apparaît lorsque l'utilisateur crée une nouvelle partie"
        },
        {
          "type": "feature",
          "text": "Ajout d'un mécanisme d'astuces qui aide l'utilisateur dynamiquement pendant le jeu. Cela sera étendu dans les versions ultérieures"
        },
        {
          "type": "feature",
          "text": "Ajout d'un mécanisme de commentaires pour permettre aux utilisateurs d'envoyer des retours aux développeurs"
        },
        {
          "type": "improvement",
          "text": "L'authentification/première connexion a été améliorée. Maintenant, elle ne nécessite pas l'approbation de l'admin, et un e-mail de bienvenue est automatiquement envoyé à l'utilisateur."
        },
        {
          "type": "improvement",
          "text": "Ajout de la dynamique de marché externe. Amélioration de la gestion de l'historique des prix du marché."
        },
        {
          "type": "improvement",
          "text": "Ajout du générateur thermique, du moulin à vent et de la centrale à charbon"
        }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2024-01-20",
      "highlights": "Nouveau look&feel de l'IU. Améliorations de la recherche.",
      "changes": [
        {
          "type": "feature",
          "text": "Nouveau look&feel de l'IU, avec des couleurs différentes. Ajout du logo du jeu."
        },
        {
          "type": "feature",
          "text": "Nouvelle mécanique de recherche : Expérience ciblée."
        },
        {
          "type": "feature",
          "text": "Mécanique de recherche : Ajustement de la façon dont les prototypes sont construits après le déblocage de la recette."
        },
        {
          "type": "improvement",
          "text": "Ajout d'un badge pour afficher les recettes en attente de déblocage dans l'onglet Recherche."
        },
        {
          "type": "improvement",
          "text": "Refonte du sol autour de l'usine."
        },
        {
          "type": "improvement",
          "text": "Ajout d'une exigence de carburant pour les générateurs, et ajustement des générateurs en général."
        },
        {
          "type": "fix",
          "text": "Les matériaux ne seront consommés qu'une fois le prototype construit."
        }
      ]
    }
  ]
}
